app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

  def create
    @lesson = Lesson.new(lesson_params)

    respond_to do |format|
      if @lesson.save
---
INSERT INTO "lessons" ("name", "description", "season_start", "season_end", "min_age", "max_age", "price", "cover_img_path", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @lesson.update(lesson_params)
---
UPDATE "lessons" SET "name" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["name", "Test  1"], ["updated_at", "2024-02-22 09:52:43.615553"], ["id", 2]]

  def destroy
    @lesson.destroy!
---
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 1]]

    def set_lesson
      @lesson = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]